## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 27 to add, 4 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      ~ id      = "3985668219" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:820252213580:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "dynamodb:BatchGetItem",
              - "dynamodb:ConditionCheckItem",
              - "dynamodb:GetItem",
              - "dynamodb:Query",
              - "dynamodb:Scan",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics",
              + "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/appstore-metrics-etl",
              + "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server",
              + "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/server-metrics-etl",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ecr:BatchGetImage",
              - "ecr:GetDownloadUrlForlayer",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server",
              + "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
              + "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              + "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
              + "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              - "logs:CreateLogGroup",
              - "logs:CreateLogStream",
              - "logs:PutLogEvents",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "arn:aws:ec2:ca-central-1:820252213580:network-interface/*",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ec2:CreateNetworkInterface",
              - "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "*",
              - "arn:aws:ec2:ca-central-1:820252213580:network-interface/*",
            ]
            # (1 unchanged attribute hidden)
        }
      ~ statement {
          ~ actions       = [
              - "ec2:DescribeNetworkInterfaces",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "*",
              + "arn:aws:s3:::masked-metrics-tdvfd-production",
              + "arn:aws:s3:::masked-metrics-tdvfd-production/*",
              + "arn:aws:s3:::unmasked-metrics-tdvfd-production",
              + "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
            ]
            # (1 unchanged attribute hidden)
        }
      - statement {
          - actions       = [
              - "s3:PutObject",
              - "s3:PutObjectAcl",
            ] -> null
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [
              - "arn:aws:s3:::masked-metrics-tdvfd-production",
              - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
              - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
              - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
            ] -> null
        }
    }

  # data.aws_iam_policy_document.get_metrics_token_secret_value_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "get_metrics_token_secret_value_ecs_task"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.scheduled_task_cw_event_role_cloudwatch_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scheduled_task_cw_event_role_cloudwatch_policy"  {
      ~ id      = "2427794541" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::820252213580:role/metrics_task_execution_role",
                          - "arn:aws:iam::820252213580:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_policy.etl_policies will be updated in-place
  ~ resource "aws_iam_policy" "etl_policies" {
        id        = "arn:aws:iam::820252213580:policy/ETLTaskExecutionPolicies"
        name      = "ETLTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:ConditionCheckItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:820252213580:repository/covid-server/metrics-server"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:820252213580:log-group:/aws/ecs/masked_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:820252213580:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::unmasked-metrics-tdvfd-production",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production/*",
                          - "arn:aws:s3:::masked-metrics-tdvfd-production",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.get_metrics_token_secret_value_ecs_task will be created
  + resource "aws_iam_policy" "get_metrics_token_secret_value_ecs_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GetMetricstokenSecretValuePolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.readonly_aggregate_metrics will be created
  + resource "aws_iam_policy" "readonly_aggregate_metrics" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ReadOnlyTableTaskExecutionPolicies"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:820252213580:table/aggregate_metrics"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.server_appstore_task_execution_role will be created
  + resource "aws_iam_role" "server_appstore_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_appstore_metrics_task_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.server_metrics_container_execution_role will be created
  + resource "aws_iam_role" "server_metrics_container_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_metrics_container_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.scheduled_task_cw_event_role_cloudwatch_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "scheduled_task_cw_event_role_cloudwatch_policy" {
        id     = "etl-st-cw-role:etl-st-cw-policy"
        name   = "etl-st-cw-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::820252213580:role/metrics_task_execution_role",
                          - "arn:aws:iam::820252213580:role/container_execution_role",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.readonly_table_te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "readonly_table_te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_task_execution_role"
    }

  # aws_iam_role_policy_attachment.secretsmanager_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "secretsmanager_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "server_metrics_container_execution_role"
    }

  # aws_iam_role_policy_attachment.server_appstore_te_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "server_appstore_te_etl_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::820252213580:policy/ETLTaskExecutionPolicies"
      + role       = "server_appstore_metrics_task_execution_role"
    }

  # aws_secretsmanager_secret.metrics_token will be created
  + resource "aws_secretsmanager_secret" "metrics_token" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "server-metrics-token"
      + name_prefix             = (known after apply)
      + policy                  = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)
      + tags_all                = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.metrics_token will be created
  + resource "aws_secretsmanager_secret_version" "metrics_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.masked_appstore_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/masked_appstore_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-masked-appstore-metrics"
          + "bucket_name"           = "masked-metrics-tdvfd-production"
          + "environment"           = "production"
          + "image"                 = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:7e972df01ac3e1e4226cb91184554d1543b4bff2"
          + "mask_data"             = "True"
          + "name"                  = "masked_appstore_metrics"
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_appstore_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "masked_appstore_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_appstore_metrics-cw-event-rule"
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "masked_appstore_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_appstore_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "masked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_metrics_event_rule-terraform-20210623205803383100000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:19" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4819f93a1a68f0147be3536513cee4e07d766f47" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:7e972df01ac3e1e4226cb91184554d1543b4bff2"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_metrics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.masked_server_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "${server_events_endpoint}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "metrics_token"
                          + valueFrom = "${metric_token_secret_arn}"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"           = "/aws/ecs/masked_server_metrics_ecs"
          + "awslogs-region"          = "ca-central-1"
          + "awslogs-stream-prefix"   = "ecs-masked-server-metrics"
          + "bucket_name"             = "masked-metrics-tdvfd-production"
          + "environment"             = "production"
          + "image"                   = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:7e972df01ac3e1e4226cb91184554d1543b4bff2"
          + "mask_data"               = "True"
          + "metric_token_secret_arn" = (known after apply)
          + "name"                    = "masked_server_metrics"
          + "server_events_endpoint"  = "https://retrieval.covid-notification.alpha.canada.ca/events"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_server_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "masked_server_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_server_metrics-cw-event-rule"
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "masked_server_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_server_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "masked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.unmasked_appstore_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                        },
                    ]
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/unmasked_appstore_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-unmasked-appstore-metrics"
          + "bucket_name"           = "unmasked-metrics-tdvfd-production"
          + "environment"           = "production"
          + "image"                 = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:7e972df01ac3e1e4226cb91184554d1543b4bff2"
          + "mask_data"             = "False"
          + "name"                  = "unmasked_appstore_metrics"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_appstore_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "unmasked_appstore_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_appstore_metrics-cw-event-rule"
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "unmasked_appstore_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_appstore_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "unmasked_appstore_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_metrics_event_rule-terraform-20210623205803384500000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:18" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4819f93a1a68f0147be3536513cee4e07d766f47" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:7e972df01ac3e1e4226cb91184554d1543b4bff2"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_metrics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                      + {
                          + name  = "SERVER_EVENTS_ENDPOINT"
                          + value = "${server_events_endpoint}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "metrics_token"
                          + valueFrom = "${metric_token_secret_arn}"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + vars     = {
          + "awslogs-group"           = "/aws/ecs/unmasked_server_metrics_ecs"
          + "awslogs-region"          = "ca-central-1"
          + "awslogs-stream-prefix"   = "ecs-unmasked-server-metrics"
          + "bucket_name"             = "unmasked-metrics-tdvfd-production"
          + "environment"             = "production"
          + "image"                   = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:7e972df01ac3e1e4226cb91184554d1543b4bff2"
          + "mask_data"               = "False"
          + "metric_token_secret_arn" = (known after apply)
          + "name"                    = "unmasked_server_metrics"
          + "server_events_endpoint"  = "https://retrieval.covid-notification.alpha.canada.ca/events"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_server_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "unmasked_server_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_server_metrics-cw-event-rule"
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:820252213580:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::820252213580:role/etl-st-cw-role"
      + rule           = "unmasked_server_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-0b77afa7e1b78c3c2",
                ]
              + subnets          = [
                  + "subnet-0279dfba069f58e92",
                ]
            }
        }
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_server_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::820252213580:role/container_execution_role"
      + family                   = "unmasked_server_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = (known after apply)
    }

Plan: 27 to add, 4 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>